# 4.5 Data Consistency

In [1]:
#Import libraries
import pandas as pd
import numpy as np
import os

This script contains the following points:
1. Importing of products and orders data
2. Performing EDA on dataframes for mixed data types, null values, and duplicates

In [2]:
path=r'C:\Users\dell\Desktop\Career Foundry\0423_Instacart Analysis'

In [3]:
vars_list=['order_id','user_id','order_number','orders_day_of_week','order_hour_of_day','#ofdays_since_last_order']

In [4]:
#Import data set products.csv
df_prods=pd.read_csv(os.path.join(path,'02 Data','Original Data','products.csv'),index_col=False)

In [5]:
#Import data set orders_wrangled.csv
df_orders=pd.read_csv(os.path.join(path,'02 Data','Prepared Data','orders_wrangled.csv'),usecols=vars_list)

In [6]:
df_orders.describe()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,#ofdays_since_last_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [7]:
#Create a dataframe
df_test=pd.DataFrame()

In [8]:
#Create a mixed type column
df_test['mix']=['a','b',1,True]

In [9]:
df_test.head

<bound method NDFrame.head of     mix
0     a
1     b
2     1
3  True>

In [10]:
#Data check for mixed-type values
for col in df_test.columns.tolist():
    weird=(df_test[[col]].applymap(type)!=df_test[[col]].iloc[0].apply(type)).any(axis=1)
    if len(df_test[weird])>0:
        print(col)

mix

In [11]:
#Convert df_test to string value
df_test['mix']=df_test['mix'].astype('str')

In [12]:
#Data check for mixed-type values
for col in df_test.columns.tolist():
    weird=(df_test[[col]].applymap(type)!=df_test[[col]].iloc[0].apply(type)).any(axis=1)
    if len(df_test[weird])>0:
        print(col)

#No mixed type data sets found after conversion

In [13]:
#Find null values in product dataframe
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [14]:
df_nan=df_prods[df_prods['product_name'].isnull()==True]

In [15]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [16]:
#Find median value
df_prods.median()

C:\Users\dell\AppData\Local\Temp\ipykernel_11800\2010277751.py:2: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df_prods.median()

product_id       24845.0
aisle_id            69.0
department_id       13.0
prices               7.1
dtype: float64

In [17]:
df_prods.shape

(49693, 5)

In [18]:
#Removing null values from products dataframe
df_prods_clean=df_prods[df_prods['product_name'].isnull()==False]

In [19]:
df_prods_clean.shape

(49677, 5)

In [20]:
#Removing null values from products dataframe via drop
df_prods.dropna(subset=['product_name'],inplace=True)

In [21]:
df_prods.shape

(49677, 5)

In [22]:
#Find duplicate values from products dataframe
df_dups=df_prods_clean[df_prods_clean.duplicated()]

In [23]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [24]:
df_prods_clean.shape

(49677, 5)

In [25]:
#Removing duplicate values from products dataframe
df_prods_clean_no_dups=df_prods_clean.drop_duplicates()

In [26]:
df_prods_clean_no_dups.shape

(49672, 5)

In [27]:
df_prods_clean_no_dups.to_csv(os.path.join(path,'02 Data','Prepared Data','products_checked.csv'))

# Exercise 4.5 Data Checks on Orders dataframe

In [28]:
df_orders.describe()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,#ofdays_since_last_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

# Orders_day_of_week and order_hour_of_day appear to start at a zero minimum value

In [29]:
df_orders['orders_day_of_week'].value_counts

<bound method IndexOpsMixin.value_counts of 0          2
1          3
2          3
3          4
4          4
          ..
3421078    5
3421079    4
3421080    1
3421081    1
3421082    6
Name: orders_day_of_week, Length: 3421083, dtype: int64>

In [30]:
df_orders['order_hour_of_day'].value_counts

<bound method IndexOpsMixin.value_counts of 0           8
1           7
2          12
3           7
4          15
           ..
3421078    18
3421079    10
3421080    12
3421081    12
3421082    14
Name: order_hour_of_day, Length: 3421083, dtype: int64>

# Further review of counts for both columns show 2 zero records in orders_day_of_week and 8 zero records in order_hour_of_day

In [31]:
#Data check for mixed-type values within orders dataframe
for col in df_orders.columns.tolist():
    weird=(df_orders[[col]].applymap(type)!=df_orders[[col]].iloc[0].apply(type)).any(axis=1)
    if len(df_orders[weird])>0:
        print(col)

# No mixed-type values exist as no columns printed(displayed)

In [32]:
#Find null values in orders dataframe
df_orders.isnull().sum()

order_id                         0
user_id                          0
order_number                     0
orders_day_of_week               0
order_hour_of_day                0
#ofdays_since_last_order    206209
dtype: int64

# Only one column, '#ofdays_since_last_order', has null values. From previous review of this data, I know the first order record for each customer returns a null value. I don't want to lose this data so I won't remove/filter out these records. Creating a new variable will create a mix-type value if I use anything under than a number. Knowing that there are no prior order records, I feel comfortable imputing a zero record.

In [33]:
df_orders['#ofdays_since_last_order'].fillna(0, inplace=True)

In [34]:
#Re-check of null values in orders dataframe
df_orders.isnull().sum()

order_id                    0
user_id                     0
order_number                0
orders_day_of_week          0
order_hour_of_day           0
#ofdays_since_last_order    0
dtype: int64

In [35]:
#Find duplicate values from orders dataframe
df_order_dups=df_orders[df_orders.duplicated()]

In [36]:
df_order_dups

Empty DataFrame
Columns: [order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, #ofdays_since_last_order]
Index: []

# No duplicates found after running assigned df_order_dups dataframe. Had any rows returned with a duplicate value, I would have used drop_duplicates() to remove them from the dataframe rather than renaming the dataframe again as this makes for a cleaner reference on the export

In [37]:
df_orders.to_csv(os.path.join(path,'02 Data','Prepared Data','orders_checked.csv'))